In [3]:
# Series 연산
# from pandas as pd 보다 아래처럼 기술하는 경우가 많다.
from pandas import Series

s1 = Series([10, 15, 20], index=['일','이','삼'])
s2 = Series([2,4,6,8], index=['일','이','삼','사'])

In [4]:
print(s1)

일    10
이    15
삼    20
dtype: int64

In [5]:
print(s2)

일    2
이    4
삼    6
사    8
dtype: int64

In [6]:
print(s1+s2) # 합연산이 가능하다. but -> 사 : NaN 발생 (가비지 처리 / 뒷처리필요)

사     NaN
삼    26.0
이    19.0
일    12.0
dtype: float64

In [7]:
s3 = Series([1,2,3],index=['1줄','2줄','3줄'])

print(s1+s3) # 같은 index로만 해야지 가능, 외 에는 전부 garbage처리

1줄   NaN
2줄   NaN
3줄   NaN
삼    NaN
이    NaN
일    NaN
dtype: float64

In [9]:
# DataFrame 연산

from pandas import DataFrame
import numpy as np

#df1 = DataFrame(np.zeros((3,3), dtype='int32'), index=['one','two','three']) -> 0로 채워짐
df1 = DataFrame(np.ones((3,3), dtype='int32'), index=['one','two','three']) # -> 1로 채워짐

df1

       0  1  2
one    1  1  1
two    1  1  1
three  1  1  1

In [14]:
# df1 + 3 표현 보다는 가급적 변수에 담아서 표현 바람.
df2 = df1 + 3
df2
df3 = df2 * 2
df2

       0  1  2
one    4  4  4
two    4  4  4
three  4  4  4

In [20]:
df3 = DataFrame(np.ones((4,4), dtype='int32'), index=['one','two','three','four'])

df3

       0  1  2  3
one    1  1  1  1
two    1  1  1  1
three  1  1  1  1
four   1  1  1  1

In [24]:
df2 + df3
# df2 원래 요소와 비교 했을 때, index를 찾으면 나오고 아닌 친구들은 NaN

         0    1    2   3
four   NaN  NaN  NaN NaN
one    5.0  5.0  5.0 NaN
three  5.0  5.0  5.0 NaN
two    5.0  5.0  5.0 NaN

In [21]:
df3.add(df2) # sub(), mul(), div() 등 다른 사칙연산 함수도 사용해보기

         0    1    2   3
four   NaN  NaN  NaN NaN
one    5.0  5.0  5.0 NaN
three  5.0  5.0  5.0 NaN
two    5.0  5.0  5.0 NaN

문자열이 있는 데이타프레임의 연산

In [28]:
mydata = {
          'name':['홍길동','박길동','김길동'], 
          'age':[22,33,44], 
          'dept':['컴공','국어','산업']
         }

# ----------------------
df = DataFrame(mydata)
df

  name  age dept
0  홍길동   22   컴공
1  박길동   33   국어
2  김길동   44   산업

In [32]:
#df + 100 #typeError
df * 2 #python처럼 문자열은 반복 & 숫자는 연산

     name  age  dept
0  홍길동홍길동   44  컴공컴공
1  박길동박길동   66  국어국어
2  김길동김길동   88  산업산업